[{
  "title": "Side Quests",
  "author": "Kernelcon",
  "id": "sq",
  "hidden": false,
  "logo": {
    "dark_mode_support": false,
    "image_name": "side-quests.png",
    "image_class": "",
    "dark_mode_image_name": "",
    "dark_mode_image_class": ""
  },
  "dates": [{
      "day": "Thursday, April 4th"
    },
    {
      "day": "Friday, April 5th"
    }
  ],
  "description": "Who is the most well-rounded hacker at Kernelcon? Join in our second annual Side Quests competition. Throughout the con, there will be challenges spread far and wide, such as, can you pick a lock, can you escape, can you solve this web vulnerability, and what do you know about networking? Check out the public scoreboard and compete in Kernelcon Side Quests.  The competition will run for two solid days, so there is plenty of time to compete and attend your desired talks. The winner can expect to receive a prize (last year's was an Eternal Kernel) for all their hard work proving they are, without a doubt, Kernelcon's most well-rounded hacker!"
},{
  "title": "Annual Kernelcon CTF",
  "author": "",
  "id": "ctf",
  "hidden": false,
  "logo": {
    "dark_mode_support": false,
    "image_name": "2fast2ctf.png",
    "image_class": "logo-reverse",
    "dark_mode_image_name": "",
    "dark_mode_image_class": ""
  },
  "dates": [{
      "day": "Thursday, April 4th"
    },
    {
      "day": "Friday, April 5th"
    }
  ],
  "description": "Our Annual Kernelcon Capture the Flag event is back and better than ever, with all new challenges, prizes and this year it's all about Family! Join the Torettos as they solve challenges with fast cars, daring heists, and family barbeques in the style of perhaps, the single, greatest film franchise to grace cinema. The competition this year is sure to be fierce with the winning team receiving our coveted <a class='text-highlight' href='/about#reciprocity'>Eternal Kernel badges</a>. CTF challenges to include web hacking, reversing, pwning, cryptography, and a whole lot more.  Do you have the team to beat this year?  If so, we will see you at Kernelcon CTF!"
},{
  "title": "Kernelcon Escape Room",
  "author": "Falkor Security",
  "id": "esc",
  "hidden": false,
  "logo": {
    "dark_mode_support": false,
    "image_name": "escape_room.png",
    "image_class": "",
    "dark_mode_image_name": "",
    "dark_mode_image_class": ""
  },
  "dates": [{
      "day": "Thursday, April 4th"
    },
    {
      "day": "Friday, April 5th"
    }
  ],
  "description": "Introducing Kernelcon’s second annual escape room! It’s a fixed race and the conditions are questionable. Someone is trying to manipulate the FCR Race season. Teams of six can sneak into the offices and do a quick investigation, but only have 30 minutes to find the clues, solve the mystery, and get out. Gather your friends to test your wits and compete in this fun side quest."
},{
  "title": "Line Following Robot Race",
  "author": "Kernelcon",
  "id": "robot",
  "hidden": false,
  "logo": {
    "dark_mode_support": false,
    "image_name": "roborace.png",
    "image_class": "",
    "dark_mode_image_name": "",
    "dark_mode_image_class": ""
  },
  "dates": [{
      "day": "Thursday, April 4th"
    },
    {
      "day": "Friday, April 5th"
    }
  ],
  "description": "You read that right. Each year we've added something new in terms of competitions from the Science Fair to the Speed Cat6 Cable contest. This year is no different as we've leveled up a line following robot competition.  Build your own or play with ours, it is sure to be a fun time.  There are obstacles, confusing turns, and more to be expected on the competition floor so you'll have to code them all. More information available at the <a class='text-highlight' href='/robo-race'>Robo Race</a> link in the navbar above!  Online kits range in price and we'd love to showcase some fun and unique builds from our crowds. P.S. - You can expect this competition will play into the overall side quests competition as well."
},{
  "title": "Kernelcon Corn Cob Catcher",
  "author": "Kernelcon",
  "id": "catch",
  "hidden": false,
  "logo": {
    "dark_mode_support": false,
    "image_name": "corncatcher.jpg",
    "image_class": "",
    "dark_mode_image_name": "",
    "dark_mode_image_class": ""
  },
  "dates": [{
      "day": "Thursday, April 4th"
    },
    {
      "day": "Friday, April 5th"
    }
  ],
  "description": "<b>How to play the Kernelcon Corn Cob Catcher</b><ol class='catcher'><li>Press the top doorbell to turn on the magnets.</li><li>Attach the corn cobs to the magnets. If you take too long the magnets will shut off to prevent overheating.</li><li>When ready press the second button to start a 5 second timer before they begin randomly dropping.</li><li>Attempt to catch all the corn cobs.</li><li>Return the corn cobs to the basket when done.</li></ol><span class='warning'>Please don't steal the corn cobs :)</span>"
}]